localization/event_pull.xml

<s:Envelope xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:e="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
    <s:Header>
        <a:To>http://gilroy:5985/wsman</a:To>
        <w:ResourceURI s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/EventLog</w:ResourceURI>
        <a:ReplyTo>
            <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
        </a:ReplyTo>
        <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Pull</a:Action>
        <w:MaxEnvelopeSize s:mustUnderstand="true">153600</w:MaxEnvelopeSize>
        <a:MessageID>uuid:DC17922E-EBE7-4333-B92A-7157EB372F33</a:MessageID>
        <w:Locale s:mustUnderstand="false" xml:lang="en-US"/>
        <p:DataLocale s:mustUnderstand="false" xml:lang="en-US"/>
        <w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <w:Option Name="SubscriptionName">ZenossSubscription</w:Option>
            <w:Option Name="ContentFormat">RenderedText</w:Option>
            <w:Option Name="IgnoreChannelError" xsi:nil="true"/>
        </w:OptionSet>
        <w:OperationTimeout>PT5.000S</w:OperationTimeout>
    </s:Header>
    <s:Body>
        <n:Pull>
            <n:EnumerationContext xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration">{enumeration_context}</n:EnumerationContext>
            <n:MaxElements>32000</n:MaxElements>
        </n:Pull>
    </s:Body>
</s:Envelope>
